Repository: kadirl/csci361-group-project-mobile
Catalog: lib/l10n/app_*.arb
Languages: kk, ru

# linkingsUnlinked
source: Unlinked
kk: Байланысы жойылған
ru: Отвязана

# linkingsNoLinkings
source: No linkings found
kk: Байланыстар табылмады
ru: Связи не найдены

# linkingsNoCompaniesMatch
source: No companies found matching "{query}"
kk: "{query}" сәйкес келетін компаниялар табылмады
ru: Компании, соответствующие "{query}", не найдены

# linkingsSearchCompanies
source: Search companies...
kk: Компанияларды іздеу...
ru: Поиск компаний...

# linkingsMessage
source: Message: {message}
kk: Хабарлама: {message}
ru: Сообщение: {message}

# linkingsCreated
source: Created: {date}
kk: Құрылған: {date}
ru: Создана: {date}

# linkingsAcceptedSuccess
source: Linking accepted
kk: Байланыс қабылданды
ru: Связь принята

# linkingsAcceptError
source: Error accepting linking: {error}
kk: Байланысты қабылдау қатесі: {error}
ru: Ошибка принятия связи: {error}

# linkingsRejectedSuccess
source: Linking rejected
kk: Байланыс қабылданбады
ru: Связь отклонена

# linkingsRejectError
source: Error rejecting linking: {error}
kk: Байланысты қабылдамау қатесі: {error}
ru: Ошибка отклонения связи: {error}

# linkingsDetailsTitle
source: Linking Details
kk: Байланыс мәліметтері
ru: Детали связи

# linkingsFailedToLoadCompany
source: Failed to load company
kk: Компанияны жүктеу сәтсіз
ru: Не удалось загрузить компанию

# linkingsFailedToLoadContactPerson
source: Failed to load contact person
kk: Контактті жүктеу сәтсіз
ru: Не удалось загрузить контактное лицо

# linkingsFailedToLoadSalesperson
source: Failed to load salesperson
kk: Сатушыны жүктеу сәтсіз
ru: Не удалось загрузить продавца

# linkingsCompany
source: Company
kk: Компания
ru: Компания

# linkingsConsumerContact
source: Consumer Contact
kk: Тұтынушы контакты
ru: Контакт потребителя

# linkingsSupplierContact
source: Supplier Contact (Assigned Salesperson)
kk: Жеткізуші контакты (Тағайындалған сатушы)
ru: Контакт поставщика (Назначенный продавец)

# linkingsOpenChat
source: Open Chat
kk: Чатты ашу
ru: Открыть чат

# linkingsUnlinkTitle
source: Unlink Companies
kk: Компанияларды ажырату
ru: Отвязать компании

# linkingsUnlinkMessage
source: Are you sure you want to unlink these companies? This action cannot be undone.
kk: Сіз бұл компанияларды ажыратқыңыз келе ме? Бұл әрекетті болдырмауға болмайды.
ru: Вы уверены, что хотите отвязать эти компании? Это действие нельзя отменить.

# linkingsUnlink
source: Unlink
kk: Ажырату
ru: Отвязать

# linkingsUnlinkedSuccess
source: Companies unlinked
kk: Компаниялар ажыратылды
ru: Компании отвязаны

# linkingsUnlinkError
source: Error unlinking: {error}
kk: Ажырату қатесі: {error}
ru: Ошибка отвязки: {error}

# linkingsReject
source: Reject
kk: Қабылдамау
ru: Отклонить

# linkingsAccept
source: Accept
kk: Қабылдау
ru: Принять

# supplierComplaintsNoAssigned
source: No assigned complaints
kk: Тағайындалған шағымдар жоқ
ru: Нет назначенных жалоб

# supplierComplaintsNoEscalated
source: No escalated complaints
kk: Эскалацияланған шағымдар жоқ
ru: Нет эскалированных жалоб

# supplierComplaintsNoManaged
source: No managed complaints
kk: Басқарылатын шағымдар жоқ
ru: Нет управляемых жалоб

# supplierComplaintsNoComplaints
source: No complaints
kk: Шағымдар жоқ
ru: Нет жалоб

# supplierComplaintsNoLinkingsComplaints
source: No complaints for your linkings
kk: Байланыстарыңызға шағымдар жоқ
ru: Нет жалоб для ваших связей

# supplierComplaintsEscalated
source: Escalated
kk: Эскалацияланған
ru: Эскалированные

# supplierComplaintsMyManaged
source: My Managed
kk: Менің басқаратын
ru: Мои управляемые

# supplierComplaintsAllComplaints
source: All Complaints
kk: Барлық шағымдар
ru: Все жалобы

# supplierComplaintsMyLinkings
source: My Linkings
kk: Менің байланыстарым
ru: Мои связи

# supplierComplaintsClaim
source: Claim
kk: Алу
ru: Взять

# supplierComplaintsUserNotFound
source: User not found
kk: Пайдаланушы табылмады
ru: Пользователь не найден

# supplierComplaintsUnknownRole
source: Unknown user role
kk: Белгісіз пайдаланушы рөлі
ru: Неизвестная роль пользователя

# dashboardTitle
source: Dashboard
kk: Басқару панелі
ru: Панель управления

# dashboardRevenueTrend
source: Revenue Trend
kk: Кіріс тренді
ru: Тренд выручки

# dashboardOrderStatus
source: Order Status
kk: Тапсырыс статусы
ru: Статус заказа

# dashboardRecentOrders
source: Recent Orders
kk: Соңғы тапсырыстар
ru: Недавние заказы

# dashboardLowStockAlert
source: Low Stock Alert
kk: Төмен қойма ескертуі
ru: Предупреждение о низком запасе

# dashboardTotalRevenue
source: Total Revenue
kk: Жалпы кіріс
ru: Общая выручка

# dashboardOrdersToday
source: Orders Today
kk: Бүгінгі тапсырыстар
ru: Заказы сегодня

# dashboardCreatedOrders
source: Created Orders
kk: Құрылған тапсырыстар
ru: Созданные заказы

# dashboardLowStock
source: Low Stock
kk: Төмен қойма
ru: Низкий запас

# dashboardNoRevenueData
source: No revenue data available
kk: Кіріс деректері қолжетімсіз
ru: Данные о выручке недоступны

# dashboardNoOrderData
source: No order data available
kk: Тапсырыс деректері қолжетімсіз
ru: Данные о заказах недоступны

# dashboardNoRecentOrders
source: No recent orders
kk: Соңғы тапсырыстар жоқ
ru: Нет недавних заказов

# dashboardNoLowStockAlerts
source: No low stock alerts
kk: Төмен қойма ескертулері жоқ
ru: Нет предупреждений о низком запасе

# dashboardErrorLoading
source: Error loading dashboard: {error}
kk: Басқару панелін жүктеу қатесі: {error}
ru: Ошибка загрузки панели управления: {error}

# dashboardStock
source: Stock: {current} / {threshold}
kk: Қойма: {current} / {threshold}
ru: Запас: {current} / {threshold}

# cartEmpty
source: Your cart is empty
kk: Сіздің себетіңіз бос
ru: Ваша корзина пуста

# cartEmptyMessage
source: Add products from companies to get started
kk: Бастау үшін компаниялардан өнімдерді қосыңыз
ru: Добавьте продукты из компаний, чтобы начать

# cartFailedToLoadProducts
source: Failed to load products
kk: Өнімдерді жүктеу сәтсіз
ru: Не удалось загрузить продукты

# cartCheckout
source: Checkout
kk: Тапсырысты рәсімдеу
ru: Оформить заказ

# cartConfirmCheckout
source: Confirm Checkout
kk: Тапсырысты растау
ru: Подтвердить оформление заказа

# cartCheckoutMessage
source: Complete order with {companyName}?
kk: {companyName} компаниясымен тапсырысты аяқтау керек пе?
ru: Завершить заказ с {companyName}?

# cartTotal
source: Total: {total} ₸
kk: Барлығы: {total} ₸
ru: Итого: {total} ₸

# cartItems
source: Items: {count}
kk: Тауарлар: {count}
ru: Товары: {count}

# cartUserCompanyNotFound
source: User company not found
kk: Пайдаланушы компаниясы табылмады
ru: Компания пользователя не найдена

# cartVerifyLinkingError
source: Failed to verify linking: {error}
kk: Байланысты тексеру сәтсіз: {error}
ru: Не удалось проверить связь: {error}

# cartLinkingNotAccepted
source: Linking with this supplier is not accepted
kk: Бұл жеткізушімен байланыс қабылданбаған
ru: Связь с этим поставщиком не принята

# cartNoValidProducts
source: No valid products to order
kk: Тапсырыс беруге жарамды өнімдер жоқ
ru: Нет действительных продуктов для заказа

# cartOrderCreatedSuccess
source: Order created successfully
kk: Тапсырыс сәтті құрылды
ru: Заказ успешно создан

# cartOrderCreateError
source: Failed to create order: {error}
kk: Тапсырыс құру сәтсіз: {error}
ru: Не удалось создать заказ: {error}

# cartErrorLoadingCompany
source: Error loading company: {error}
kk: Компанияны жүктеу қатесі: {error}
ru: Ошибка загрузки компании: {error}

# cartTotalLabel
source: Total: {total} ₸
kk: Барлығы: {total} ₸
ru: Итого: {total} ₸

# cartItemTotal
source: Total: {total} ₸
kk: Барлығы: {total} ₸
ru: Итого: {total} ₸

# cartRemove
source: Remove
kk: Жою
ru: Удалить

# cartQuantity
source: Quantity ({unit})
kk: Саны ({unit})
ru: Количество ({unit})

# companiesSearchCompanies
source: Search companies...
kk: Компанияларды іздеу...
ru: Поиск компаний...

# companiesErrorLoading
source: Error loading companies
kk: Компанияларды жүктеу қатесі
ru: Ошибка загрузки компаний

# companiesNoCompanies
source: No companies yet
kk: Әлі компаниялар жоқ
ru: Пока нет компаний

# companiesNoMatch
source: No companies found matching "{query}"
kk: "{query}" сәйкес келетін компаниялар табылмады
ru: Компании, соответствующие "{query}", не найдены

# companiesDetailsTitle
source: Company Details
kk: Компания мәліметтері
ru: Детали компании

# companiesFailedToFetch
source: Failed to fetch
kk: Алу сәтсіз
ru: Не удалось получить

# companiesDescription
source: Description
kk: Сипаттама
ru: Описание

# companiesProducts
source: Products
kk: Өнімдер
ru: Продукты

# companiesNoProducts
source: No products available
kk: Қолжетімді өнімдер жоқ
ru: Нет доступных продуктов

# companiesSendLinking
source: Send Linking
kk: Байланыс жіберу
ru: Отправить связь

# companiesLinkingPending
source: Linking Pending
kk: Байланыс күтуде
ru: Связь в ожидании

# companiesLinkingRejected
source: Linking Rejected
kk: Байланыс қабылданбады
ru: Связь отклонена

# companiesUnlinked
source: Unlinked
kk: Байланысы жойылған
ru: Отвязана

# companiesSendLinkingRequest
source: Send Linking Request
kk: Байланыс сұрауын жіберу
ru: Отправить запрос на связь

# companiesLinkingMessage
source: Message
kk: Хабарлама
ru: Сообщение

# companiesLinkingMessagePlaceholder
source: Enter your message...
kk: Хабарламаңызды енгізіңіз...
ru: Введите ваше сообщение...

# companiesLinkingMessageRequired
source: Message cannot be empty
kk: Хабарлама бос болмауы керек
ru: Сообщение не может быть пустым

# companiesLinkingRequestSent
source: Linking request sent successfully
kk: Байланыс сұрауы сәтті жіберілді
ru: Запрос на связь успешно отправлен

# companiesLinkingRequestError
source: Error sending linking request: {error}
kk: Байланыс сұрауын жіберу қатесі: {error}
ru: Ошибка отправки запроса на связь: {error}

# ordersNoLinkings
source: No linkings found
kk: Байланыстар табылмады
ru: Связи не найдены

# ordersNoOrders
source: No orders
kk: Тапсырыстар жоқ
ru: Нет заказов

# ordersNoOrdersStatus
source: No orders with status: {status}
kk: {status} статусы бар тапсырыстар жоқ
ru: Нет заказов со статусом: {status}

# ordersNoCompaniesMatch
source: No companies found matching "{query}"
kk: "{query}" сәйкес келетін компаниялар табылмады
ru: Компании, соответствующие "{query}", не найдены

# ordersSearchCompanies
source: Search companies...
kk: Компанияларды іздеу...
ru: Поиск компаний...

# ordersAll
source: All
kk: Барлығы
ru: Все

# ordersLinkingNumber
source: Linking #{linkingId}
kk: Байланыс #{linkingId}
ru: Связь #{linkingId}

# ordersOrderNumber
source: Order #{orderId}
kk: Тапсырыс #{orderId}
ru: Заказ #{orderId}

# ordersCreated
source: Created: {date}
kk: Құрылған: {date}
ru: Создан: {date}

# productDetailsTitle
source: Product Details
kk: Өнім мәліметтері
ru: Детали продукта

# productAddToCart
source: Add to Cart
kk: Себетке қосу
ru: Добавить в корзину

# productDetails
source: Details
kk: Мәліметтер
ru: Детали

# productUnit
source: Unit
kk: Өлшем бірлігі
ru: Единица измерения

# productStockQuantity
source: Stock quantity
kk: Қоймадағы саны
ru: Количество на складе

# productRetailPrice
source: Retail price
kk: Бөлшек бағасы
ru: Розничная цена

# productBulkPrice
source: Bulk price
kk: Көтерме бағасы
ru: Оптовая цена

# productMinimumOrder
source: Minimum order
kk: Ең аз тапсырыс
ru: Минимальный заказ

# productThreshold
source: Threshold
kk: Шегі
ru: Порог

# productAddedToCart
source: Added {quantity} {unit} to cart
kk: Себетке {quantity} {unit} қосылды
ru: Добавлено {quantity} {unit} в корзину

# catalogNoProducts
source: No products yet
kk: Әлі өнімдер жоқ
ru: Пока нет продуктов

# catalogNoProductsMatch
source: No products found matching "{query}"
kk: "{query}" сәйкес келетін өнімдер табылмады
ru: Продукты, соответствующие "{query}", не найдены

# catalogSearchProducts
source: Search products...
kk: Өнімдерді іздеу...
ru: Поиск продуктов...

# catalogStock
source: Stock: {quantity}
kk: Қойма: {quantity}
ru: Запас: {quantity}

# catalogUserNotFound
source: User profile or company ID not found.
kk: Пайдаланушы профилі немесе компания ID табылмады.
ru: Профиль пользователя или ID компании не найдены.

# catalogCompanyNotFound
source: Company not found.
kk: Компания табылмады.
ru: Компания не найдена.

# catalogSupplierOnly
source: Catalog is available for suppliers only.
kk: Каталог тек жеткізушілерге қолжетімді.
ru: Каталог доступен только для поставщиков.

# addToCartPricePerUnit
source: Price per {unit}:
kk: {unit} үшін баға:
ru: Цена за {unit}:

# addToCartQuantity
source: Quantity ({unit})
kk: Саны ({unit})
ru: Количество ({unit})

# addToCartEnterQuantity
source: Enter quantity
kk: Санын енгізіңіз
ru: Введите количество

# addToCartQuantityRequired
source: Please enter a quantity
kk: Санын енгізіңіз
ru: Пожалуйста, введите количество

# addToCartInvalidNumber
source: Please enter a valid number
kk: Жарамды сан енгізіңіз
ru: Пожалуйста, введите действительное число

# addToCartQuantityGreaterThanZero
source: Quantity must be greater than 0
kk: Саны 0-ден үлкен болуы керек
ru: Количество должно быть больше 0

# addToCartMinimumOrder
source: Minimum order is {minimum} {unit}
kk: Ең аз тапсырыс {minimum} {unit}
ru: Минимальный заказ составляет {minimum} {unit}

# addToCartOnlyAvailable
source: Only {stock} {unit} available
kk: Тек {stock} {unit} қолжетімді
ru: Доступно только {stock} {unit}

# addToCartAvailable
source: Available: {stock} {unit}
kk: Қолжетімді: {stock} {unit}
ru: Доступно: {stock} {unit}

# addToCartMinimum
source: Minimum: {minimum} {unit}
kk: Ең аз: {minimum} {unit}
ru: Минимум: {minimum} {unit}

# addToCartButton
source: Add to Cart
kk: Себетке қосу
ru: Добавить в корзину

# settingsSignupFailed
source: Signup failed
kk: Тіркелу сәтсіз
ru: Регистрация не удалась

# userProfileCompany
source: Company
kk: Компания
ru: Компания

# userProfileLoading
source: Loading...
kk: Жүктелуде...
ru: Загрузка...

# userProfileUpdatedSuccess
source: Profile updated successfully
kk: Профиль сәтті жаңартылды
ru: Профиль успешно обновлен

# userProfileUserIdMissing
source: User ID is missing
kk: Пайдаланушы ID жоқ
ru: ID пользователя отсутствует

# userProfileFieldRequired
source: {fieldLabel} is required.
kk: {fieldLabel} міндетті.
ru: {fieldLabel} обязательно.

# userProfileFieldInvalidInteger
source: {fieldLabel} must be a valid integer.
kk: {fieldLabel} жарамды бүтін сан болуы керек.
ru: {fieldLabel} должно быть действительным целым числом.

# userEditUserIdMissing
source: User ID is missing
kk: Пайдаланушы ID жоқ
ru: ID пользователя отсутствует

# userEditProfileUpdatedSuccess
source: Profile updated successfully
kk: Профиль сәтті жаңартылды
ru: Профиль успешно обновлен

# companyProfileCompanyLogo
source: Company Logo
kk: Компания логотипі
ru: Логотип компании

# companyProfileSelectLogo
source: Select company logo
kk: Компания логотипін таңдаңыз
ru: Выберите логотип компании

# companyProfileUpdatedSuccess
source: Company profile updated successfully
kk: Компания профилі сәтті жаңартылды
ru: Профиль компании успешно обновлен

# companyProfileCompanyIdMissing
source: Company ID is missing
kk: Компания ID жоқ
ru: ID компании отсутствует

# companyProfileNameRequired
source: Name is required
kk: Атауы міндетті
ru: Название обязательно

# companyProfileLocationRequired
source: Location is required
kk: Орналасқан жері міндетті
ru: Местоположение обязательно

# companyEditLogo
source: Company Logo
kk: Компания логотипі
ru: Логотип компании

# companyEditLogoPlaceholder
source: Select company logo
kk: Компания логотипін таңдаңыз
ru: Выберите логотип компании

# companyEditCompanyIdMissing
source: Company ID is missing
kk: Компания ID жоқ
ru: ID компании отсутствует

# companyEditProfileUpdatedSuccess
source: Company profile updated successfully
kk: Компания профилі сәтті жаңартылды
ru: Профиль компании успешно обновлен

# staffManagementUserNotFound
source: User not found
kk: Пайдаланушы табылмады
ru: Пользователь не найден

# staffManagementFieldRequired
source: {fieldLabel} is required.
kk: {fieldLabel} міндетті.
ru: {fieldLabel} обязательно.

# commonNA
source: N/A
kk: Ж/О
ru: Н/Д

# commonBy
source: By
kk: Жіберген
ru: От

# commonNotAssigned
source: Not assigned
kk: Тағайындалмаған
ru: Не назначен

# commonLoading
source: Loading...
kk: Жүктелуде...
ru: Загрузка...

# commonError
source: Error
kk: Қате
ru: Ошибка

# commonOK
source: OK
kk: ОК
ru: ОК
