Repository: kadirl/csci361-group-project-mobile
Catalog: lib/l10n/app_*.arb
Languages: kk, ru

source: Welcome
kk: Қош келдіңіз
ru: Добро пожаловать

source: Sign in to continue
kk: Жалғастыру үшін кіріңіз
ru: Войдите, чтобы продолжить

source: Email
kk: Электрондық пошта
ru: Электронная почта

# emailPlaceholder
source: Enter your email
kk: Электрондық поштаңызды енгізіңіз
ru: Введите вашу электронную почту

# emailRequired
source: Please enter your email
kk: Электрондық поштаңызды енгізіңіз
ru: Пожалуйста, введите вашу электронную почту

source: Password
kk: Құпия сөз
ru: Пароль

# passwordPlaceholder
source: Enter your password
kk: Құпия сөзіңізді енгізіңіз
ru: Введите ваш пароль

# passwordRequired
source: Please enter your password
kk: Құпия сөзіңізді енгізіңіз
ru: Пожалуйста, введите ваш пароль

source: Sign In
kk: Кіру
ru: Войти

# signUp
source: Create a Company
kk: Компания құру
ru: Создать компанию

source: Logout
kk: Шығу
ru: Выйти

source: Home
kk: Басты бет
ru: Главная

source: Search
kk: Іздеу
ru: Поиск

source: Add
kk: Қосу
ru: Добавить

source: Notifications
kk: Хабарландырулар
ru: Уведомления

source: Profile
kk: Профиль
ru: Профиль

# emailAndPasswordRequired
source: Email and password are required
kk: Электрондық пошта және құпия сөз қажет
ru: Требуется электронная почта и пароль

# signupTitle
source: Create a Company
kk: Компания құру
ru: Создать компанию

# signupStep1Title
source: Company Type
kk: Компания түрі
ru: Тип компании

# signupStep1Consumer
source: Consumer
kk: Тұтынушы
ru: Потребитель

# signupStep1Supplier
source: Supplier
kk: Жеткізуші
ru: Поставщик

# signupStep2Title
source: Owner Details
kk: Иесінің мәліметтері
ru: Данные владельца

# signupStep2FirstName
source: First name
kk: Аты
ru: Имя

# signupStep2FirstNamePlaceholder
source: Please enter your first name
kk: Атыңызды енгізіңіз
ru: Пожалуйста, введите ваше имя

# signupStep2LastName
source: Last name
kk: Тегі
ru: Фамилия

# signupStep2LastNamePlaceholder
source: Please enter your last name
kk: Тегіңізді енгізіңіз
ru: Пожалуйста, введите вашу фамилию

# signupStep2PhoneNumber
source: Phone number
kk: Телефон нөмірі
ru: Номер телефона

# signupStep2Email
source: Email
kk: Электрондық пошта
ru: Электронная почта

# signupStep2Password
source: Password
kk: Құпия сөз
ru: Пароль

# signupStep2passwordPlaceholder
source: Enter your password
kk: Құпия сөзіңізді енгізіңіз
ru: Введите ваш пароль

# signupStep2passwordRequired
source: Please enter your password
kk: Құпия сөзіңізді енгізіңіз
ru: Пожалуйста, введите ваш пароль

# signupStep3Title
source: Company Details
kk: Компания мәліметтері
ru: Данные компании

# signupStep3Name
source: Company name
kk: Компания атауы
ru: Название компании

# signupStep3NamePlaceholder
source: Enter company name
kk: Компания атауын енгізіңіз
ru: Введите название компании

# signupStep3Description
source: Description
kk: Сипаттама
ru: Описание

# signupStep3DescriptionPlaceholder
source: Enter company description
kk: Компания сипаттамасын енгізіңіз
ru: Введите описание компании

# signupStep3Logo
source: Company logo
kk: Компания логотипі
ru: Логотип компании

# signupStep3LogoPlaceholder
source: Select logo file
kk: Логотип файлын таңдаңыз
ru: Выберите файл логотипа

# signupStep3Location
source: Location
kk: Орналасқан жері
ru: Местоположение

# signupStep3LocationPlaceholder
source: Select city
kk: Қаланы таңдаңыз
ru: Выберите город

# commonBack
source: Back
kk: Артқа
ru: Назад

# commonNext
source: Next
kk: Келесі
ru: Далее

# commonSubmit
source: Submit
kk: Жіберу
ru: Отправить

# commonCancel
source: Cancel
kk: Болдырмау
ru: Отмена

# commonConfirm
source: Confirm
kk: Растау
ru: Подтвердить

# commonRetry
source: Retry
kk: Қайталау
ru: Повторить

# commonBackToLogin
source: Back to sign in
kk: Кіруге оралу
ru: Вернуться к входу

# errorLoadingCitiesTitle
source: Unable to load cities
kk: Қалаларды жүктеу мүмкін емес
ru: Не удалось загрузить города

# settingsUserProfile
source: User profile
kk: Пайдаланушы профилі
ru: Профиль пользователя

# settingsCompanyProfile
source: Company profile
kk: Компания профилі
ru: Профиль компании

# settingsLanguage
source: Language
kk: Тіл
ru: Язык

# userProfileTitle
source: User profile
kk: Пайдаланушы профилі
ru: Профиль пользователя

source: First name
kk: Аты
ru: Имя

source: Last name
kk: Тегі
ru: Фамилия

source: Phone number
kk: Телефон нөмірі
ru: Номер телефона

# userRole
source: Role
kk: Рөл
ru: Роль

# userLocale
source: Locale
kk: Локаль
ru: Локаль

# companyLabel
source: Company
kk: Компания
ru: Компания

source: Refresh profile
kk: Профильді жаңарту
ru: Обновить профиль

# errorLoadingProfile
source: Failed to load profile
kk: Профильді жүктеу сәтсіз
ru: Не удалось загрузить профиль

# noUserProfile
source: No user profile available
kk: Пайдаланушы профилі қолжетімсіз
ru: Профиль пользователя недоступен

# companyProfileTitle
source: Company profile
kk: Компания профилі
ru: Профиль компании

# companyName
source: Name
kk: Атауы
ru: Название

# companyLocation
source: Location
kk: Орналасқан жері
ru: Местоположение

# companyType
source: Type
kk: Түрі
ru: Тип

# companyDescription
source: Description
kk: Сипаттама
ru: Описание

source: Company ID
kk: Компания ID
ru: ID компании

source: Refresh company
kk: Компанияны жаңарту
ru: Обновить компанию

# errorLoadingCompany
source: Failed to load company
kk: Компанияны жүктеу сәтсіз
ru: Не удалось загрузить компанию

# noCompanyProfile
source: No company profile available
kk: Компания профилі қолжетімсіз
ru: Профиль компании недоступен

# companyTypeSupplier
source: Supplier
kk: Жеткізуші
ru: Поставщик

# companyTypeConsumer
source: Consumer
kk: Тұтынушы
ru: Потребитель

# settingsStaffManagement
source: Staff Management
kk: Қызметкерлерді басқару
ru: Управление персоналом

# staffManagementTitle
source: Staff Management
kk: Қызметкерлерді басқару
ru: Управление персоналом

# catalogCreateProductTitle
source: Create product
kk: Өнім құру
ru: Создать продукт

# catalogProductNameLabel
source: Name
kk: Атауы
ru: Название

# catalogProductDescriptionLabel
source: Description
kk: Сипаттама
ru: Описание

# catalogProductStockQuantityLabel
source: Stock quantity
kk: Қоймадағы саны
ru: Количество на складе

# catalogProductRetailPriceLabel
source: Retail price
kk: Бөлшек бағасы
ru: Розничная цена

# catalogProductThresholdLabel
source: Threshold
kk: Шегі
ru: Порог

# catalogProductBulkPriceLabel
source: Bulk price
kk: Көтерме бағасы
ru: Оптовая цена

# catalogProductMinimumOrderLabel
source: Minimum order
kk: Ең аз тапсырыс
ru: Минимальный заказ

# catalogProductUnitLabel
source: Unit
kk: Өлшем бірлігі
ru: Единица измерения

# catalogProductImagesLabel
source: Product images
kk: Өнім суреттері
ru: Изображения продукта

# catalogProductImagesPlaceholder
source: Select product images (up to 5)
kk: Өнім суреттерін таңдаңыз (5-ке дейін)
ru: Выберите изображения продукта (до 5)

# catalogProductImagesMaxExceededTitle
source: Maximum images reached
kk: Максималды сурет санына жетті
ru: Достигнуто максимальное количество изображений

# catalogProductImagesMaxExceededMessage
source: You can only add up to 5 images. Some images were not added.
kk: Сіз тек 5 суретке дейін қоса аласыз. Кейбір суреттер қосылмады.
ru: Вы можете добавить только до 5 изображений. Некоторые изображения не были добавлены.

# catalogCreateProductSuccess
source: Product created successfully
kk: Өнім сәтті құрылды
ru: Продукт успешно создан

# catalogCreateProductErrorGeneric
source: Failed to create product: {error}
kk: Өнімді құру сәтсіз: {error}
ru: Не удалось создать продукт: {error}

# catalogEditProductTitle
source: Edit product
kk: Өнімді өңдеу
ru: Редактировать продукт

# catalogUpdateProductSuccess
source: Product updated successfully
kk: Өнім сәтті жаңартылды
ru: Продукт успешно обновлен

# catalogUpdateProductErrorGeneric
source: Failed to update product: {error}
kk: Өнімді жаңарту сәтсіз: {error}
ru: Не удалось обновить продукт: {error}

# catalogDeleteProductTitle
source: Delete product
kk: Өнімді жою
ru: Удалить продукт

# catalogDeleteProductMessage
source: Are you sure you want to delete this product? This action cannot be undone.
kk: Сіз бұл өнімді жойғыңыз келе ме? Бұл әрекетті болдырмауға болмайды.
ru: Вы уверены, что хотите удалить этот продукт? Это действие нельзя отменить.

# catalogDeleteProductSuccess
source: Product deleted successfully
kk: Өнім сәтті жойылды
ru: Продукт успешно удален

# catalogDeleteProductErrorGeneric
source: Failed to delete product: {error}
kk: Өнімді жою сәтсіз: {error}
ru: Не удалось удалить продукт: {error}

# staffCreateUserSuccess
source: User created successfully
kk: Пайдаланушы сәтті құрылды
ru: Пользователь успешно создан

# staffDeleteUserTitle
source: Delete user
kk: Пайдаланушыны жою
ru: Удалить пользователя

# staffDeleteUserMessage
source: Are you sure you want to delete this user? This action cannot be undone.
kk: Сіз бұл пайдаланушыны жойғыңыз келе ме? Бұл әрекетті болдырмауға болмайды.
ru: Вы уверены, что хотите удалить этого пользователя? Это действие нельзя отменить.

# staffDeleteUserSuccess
source: User deleted successfully
kk: Пайдаланушы сәтті жойылды
ru: Пользователь успешно удален

# staffDeleteUserErrorGeneric
source: Failed to delete user: {error}
kk: Пайдаланушыны жою сәтсіз: {error}
ru: Не удалось удалить пользователя: {error}

# chatTitle
source: Chat
kk: Чат
ru: Чат

# chatTypeMessage
source: Type a message...
kk: Хабарлама жазыңыз...
ru: Введите сообщение...

# chatCannotSendMessages
source: Cannot send messages
kk: Хабарлама жібере алмайсыз
ru: Нельзя отправлять сообщения

# chatLoadingPermissions
source: Loading permissions...
kk: Рұқсаттарды жүктеу...
ru: Загрузка разрешений...

# chatErrorLoadingPermissions
source: Error loading permissions
kk: Рұқсаттарды жүктеу қатесі
ru: Ошибка загрузки разрешений

# chatOnlyConsumerContact
source: Only consumer contact can send messages
kk: Тек тұтынушы контакты хабарлама жібере алады
ru: Только контакт потребителя может отправлять сообщения

# chatOnlyAssignedSalesman
source: Only assigned salesman can send messages
kk: Тек тағайындалған сатушы хабарлама жібере алады
ru: Только назначенный продавец может отправлять сообщения

# chatAttachmentImage
source: Image
kk: Сурет
ru: Изображение

# chatAttachmentFile
source: File
kk: Файл
ru: Файл

# chatAttachmentAudio
source: Audio
kk: Аудио
ru: Аудио

# chatSelectImageSource
source: Select Image Source
kk: Сурет көзіңізді таңдаңыз
ru: Выберите источник изображения

# chatImageSourceGallery
source: Gallery
kk: Галерея
ru: Галерея

# chatImageSourceCamera
source: Camera
kk: Камера
ru: Камера

# chatErrorUploadFile
source: Failed to upload file: {error}
kk: Файлды жүктеу сәтсіз: {error}
ru: Не удалось загрузить файл: {error}

# chatErrorUploadAudio
source: Failed to upload audio: {error}
kk: Аудионы жүктеу сәтсіз: {error}
ru: Не удалось загрузить аудио: {error}

# chatErrorUploadImage
source: Failed to upload image: {error}
kk: Суретті жүктеу сәтсіз: {error}
ru: Не удалось загрузить изображение: {error}

# chatMicrophonePermissionDenied
source: Microphone permission denied
kk: Микрофон рұқсаты қабылданбады
ru: Разрешение на использование микрофона отклонено

# chatErrorStartRecording
source: Failed to start recording: {error}
kk: Жазбаны бастау сәтсіз: {error}
ru: Не удалось начать запись: {error}

# chatRecordingFileNotFound
source: Recording file not found
kk: Жазба файлы табылмады
ru: Файл записи не найден

# chatErrorProcessRecording
source: Failed to process recording: {error}
kk: Жазбаны өңдеу сәтсіз: {error}
ru: Не удалось обработать запись: {error}

# chatErrorSendImage
source: Failed to send image: {error}
kk: Суретті жіберу сәтсіз: {error}
ru: Не удалось отправить изображение: {error}

# chatErrorSendFile
source: Failed to send file: {error}
kk: Файлды жіберу сәтсіз: {error}
ru: Не удалось отправить файл: {error}

# chatErrorSendAudio
source: Failed to send audio: {error}
kk: Аудионы жіберу сәтсіз: {error}
ru: Не удалось отправить аудио: {error}

# chatErrorSendMessage
source: Failed to send message: {error}
kk: Хабарламаны жіберу сәтсіз: {error}
ru: Не удалось отправить сообщение: {error}

# chatCannotOpenFileUrl
source: Cannot open file URL
kk: Файл URL-ін ашу мүмкін емес
ru: Нельзя открыть URL файла

# chatErrorDownloadFile
source: Failed to download file: {error}
kk: Файлды жүктеу сәтсіз: {error}
ru: Не удалось загрузить файл: {error}

# chatErrorPlayAudio
source: Failed to play audio: {error}
kk: Аудионы ойнату сәтсіз: {error}
ru: Не удалось воспроизвести аудио: {error}

# chatNoMessages
source: No messages yet
kk: Әлі хабарлама жоқ
ru: Пока нет сообщений

# chatError
source: Error: {error}
kk: Қате: {error}
ru: Ошибка: {error}

# chatAttachFile
source: Attach file
kk: Файлды тіркеу
ru: Прикрепить файл

# chatDownloadFile
source: Download file
kk: Файлды жүктеу
ru: Загрузить файл

# chatPause
source: Pause
kk: Кідірту
ru: Пауза

# chatPlay
source: Play
kk: Ойнату
ru: Воспроизвести

# chatStopRecording
source: Stop recording
kk: Жазбаны тоқтату
ru: Остановить запись

# chatRecordAudio
source: Record audio
kk: Аудио жазбалау
ru: Записать аудио

# chatFailedToLoadImage
source: Failed to load image
kk: Суретті жүктеу сәтсіз
ru: Не удалось загрузить изображение

# chatUserUnknown
source: User {userId}
kk: Пайдаланушы {userId}
ru: Пользователь {userId}

# chatOrderCreated
source: Order #{orderId} created with status {status}
kk: Тапсырыс #{orderId} {status} статусымен құрылды
ru: Заказ #{orderId} создан со статусом {status}

# chatOrderCreatedNoId
source: Order created with status {status}
kk: Тапсырыс {status} статусымен құрылды
ru: Заказ создан со статусом {status}

# chatComplaintCreated
source: Complaint #{complaintId} created with status {status}
kk: Шағым #{complaintId} {status} статусымен құрылды
ru: Жалоба #{complaintId} создана со статусом {status}

# chatComplaintCreatedNoId
source: Complaint created with status {status}
kk: Шағым {status} статусымен құрылды
ru: Жалоба создана со статусом {status}

# chatOrderStatusChanged
source: Order #{orderId} status changed from {oldStatus} to {newStatus}
kk: Тапсырыс #{orderId} статусы {oldStatus} мәнінен {newStatus} мәніне өзгертілді
ru: Статус заказа #{orderId} изменен с {oldStatus} на {newStatus}

# chatOrderStatusChangedNoId
source: Order status changed from {oldStatus} to {newStatus}
kk: Тапсырыс статусы {oldStatus} мәнінен {newStatus} мәніне өзгертілді
ru: Статус заказа изменен с {oldStatus} на {newStatus}

# chatComplaintStatusChanged
source: Complaint #{complaintId} status changed from {oldStatus} to {newStatus}
kk: Шағым #{complaintId} статусы {oldStatus} мәнінен {newStatus} мәніне өзгертілді
ru: Статус жалобы #{complaintId} изменен с {oldStatus} на {newStatus}

# chatComplaintStatusChangedNoId
source: Complaint status changed from {oldStatus} to {newStatus}
kk: Шағым статусы {oldStatus} мәнінен {newStatus} мәніне өзгертілді
ru: Статус жалобы изменен с {oldStatus} на {newStatus}

# chatOrderStatusRemoved
source: Order #{orderId} status removed (was {oldStatus})
kk: Тапсырыс #{orderId} статусы жойылды (бұрын {oldStatus} болған)
ru: Статус заказа #{orderId} удален (был {oldStatus})

# chatOrderStatusRemovedNoId
source: Order status removed (was {oldStatus})
kk: Тапсырыс статусы жойылды (бұрын {oldStatus} болған)
ru: Статус заказа удален (был {oldStatus})

# chatComplaintStatusRemoved
source: Complaint #{complaintId} status removed (was {oldStatus})
kk: Шағым #{complaintId} статусы жойылды (бұрын {oldStatus} болған)
ru: Статус жалобы #{complaintId} удален (был {oldStatus})

# chatComplaintStatusRemovedNoId
source: Complaint status removed (was {oldStatus})
kk: Шағым статусы жойылды (бұрын {oldStatus} болған)
ru: Статус жалобы удален (был {oldStatus})

# chatBySender
source: By {senderName}
kk: {senderName} жіберген
ru: От {senderName}

# complaintDetailsTitle
source: Complaint Details
kk: Шағым мәліметтері
ru: Детали жалобы

source: Complaint not found
kk: Шағым табылмады
ru: Жалоба не найдена

source: Complaint Information
kk: Шағым ақпараты
ru: Информация о жалобе

# complaintDescription
source: Description
kk: Сипаттама
ru: Описание

# complaintCreated
source: Created
kk: Құрылған
ru: Создана

# complaintUpdated
source: Updated
kk: Жаңартылған
ru: Обновлена

# complaintResolutionNotes
source: Resolution Notes
kk: Шешу ескертпелері
ru: Заметки о решении

# complaintOrderCancelled
source: Order Cancelled
kk: Тапсырыс Бас тартылды
ru: Заказ отменен

# complaintAssignedPersonnel
source: Assigned Personnel
kk: Тағайындалған қызметкерлер
ru: Назначенный персонал

# complaintAssignedSalesman
source: Assigned Salesman
kk: Тағайындалған сатушы
ru: Назначенный продавец

# complaintAssignedManager
source: Assigned Manager
kk: Тағайындалған менеджер
ru: Назначенный менеджер

# complaintNoManagerAssigned
source: No manager assigned
kk: Менеджер тағайындалмаған
ru: Менеджер не назначен

# complaintNoPersonnelAssigned
source: No personnel assigned
kk: Қызметкерлер тағайындалмаған
ru: Персонал не назначен

# complaintHistory
source: History
kk: Тарих
ru: История

# complaintNoHistory
source: No history available
kk: Тарих қолжетімсіз
ru: История недоступна

# complaintOpenChat
source: Open Chat
kk: Чатты ашу
ru: Открыть чат

# complaintActions
source: Actions
kk: Әрекеттер
ru: Действия

# complaintEscalateToManager
source: Escalate to Manager
kk: Менеджерге эскалациялау
ru: Эскалировать менеджеру

# complaintResolve
source: Resolve
kk: Шешу
ru: Решить

# complaintClose
source: Close
kk: Жабу
ru: Закрыть

# complaintClaimComplaint
source: Claim Complaint
kk: Шағымды алу
ru: Взять жалобу

# complaintEscalateTitle
source: Escalate Complaint
kk: Шағымды эскалациялау
ru: Эскалировать жалобу

# complaintEscalateNotes
source: Optional: Add notes explaining why you are escalating:
kk: Міндетті емес: Неге эскалациялағаныңызды түсіндіретін ескертпелер қосыңыз:
ru: Необязательно: Добавьте заметки, объясняющие, почему вы эскалируете:

# complaintEscalateNotesLabel
source: Notes
kk: Ескертпелер
ru: Заметки

# complaintEscalate
source: Escalate
kk: Эскалациялау
ru: Эскалировать

# complaintEscalatedSuccess
source: Complaint escalated successfully
kk: Шағым сәтті эскалацияланды
ru: Жалоба успешно эскалирована

# complaintEscalateError
source: Error escalating complaint: {error}
kk: Шағымды эскалациялау қатесі: {error}
ru: Ошибка эскалации жалобы: {error}

# complaintClaimTitle
source: Claim Complaint
kk: Шағымды алу
ru: Взять жалобу

# complaintClaimMessage
source: Are you sure you want to claim this complaint? You will be responsible for managing it.
kk: Сіз бұл шағымды алуға сенімдісіз бе? Сіз оны басқаруға жауапты боласыз.
ru: Вы уверены, что хотите взять эту жалобу? Вы будете нести ответственность за ее управление.

# complaintClaim
source: Claim
kk: Алу
ru: Взять

# complaintClaimedSuccess
source: Complaint claimed successfully
kk: Шағым сәтті алынды
ru: Жалоба успешно взята

# complaintClaimError
source: Error claiming complaint: {error}
kk: Шағымды алу қатесі: {error}
ru: Ошибка при взятии жалобы: {error}

# complaintResolveTitle
source: Resolve Complaint
kk: Шағымды шешу
ru: Решить жалобу

# complaintResolveNotes
source: Please provide resolution notes:
kk: Шешу ескертпелерін беріңіз:
ru: Пожалуйста, предоставьте заметки о решении:

# complaintResolveNotesLabel
source: Resolution Notes
kk: Шешу ескертпелері
ru: Заметки о решении

# complaintCancelOrder
source: Cancel Order
kk: Тапсырысты болдырмау
ru: Отменить заказ

# complaintResolveNotesRequired
source: Please enter resolution notes
kk: Шешу ескертпелерін енгізіңіз
ru: Пожалуйста, введите заметки о решении

# complaintResolvedSuccess
source: Complaint resolved successfully
kk: Шағым сәтті шешілді
ru: Жалоба успешно решена

# complaintResolveError
source: Error resolving complaint: {error}
kk: Шағымды шешу қатесі: {error}
ru: Ошибка при решении жалобы: {error}

# complaintCloseTitle
source: Close Complaint
kk: Шағымды жабу
ru: Закрыть жалобу

# complaintCloseNotes
source: Please provide notes explaining why the complaint is being closed:
kk: Шағым неге жабылатынын түсіндіретін ескертпелер беріңіз:
ru: Пожалуйста, предоставьте заметки, объясняющие, почему жалоба закрывается:

# complaintClosedSuccess
source: Complaint closed successfully
kk: Шағым сәтті жабылды
ru: Жалоба успешно закрыта

# complaintCloseError
source: Error closing complaint: {error}
kk: Шағымды жабу қатесі: {error}
ru: Ошибка при закрытии жалобы: {error}

# complaintByUser
source: By: {userName}
kk: Жіберген: {userName}
ru: От: {userName}

# complaintStatusOpen
source: OPEN
kk: АШЫҚ
ru: ОТКРЫТА

# complaintStatusEscalated
source: ESCALATED
kk: ЭСКАЛАЦИЯЛАНҒАН
ru: ЭСКАЛИРОВАНА

# complaintStatusInProgress
source: IN PROGRESS
kk: ЖҮРГІЗІЛУДЕ
ru: В РАБОТЕ

# complaintStatusResolved
source: RESOLVED
kk: ШЕШІЛГЕН
ru: РЕШЕНА

# complaintStatusClosed
source: CLOSED
kk: ЖАБЫЛҒАН
ru: ЗАКРЫТА

# orderDetailsTitle
source: Order Details
kk: Тапсырыс мәліметтері
ru: Детали заказа

source: Order not found
kk: Тапсырыс табылмады
ru: Заказ не найден

# orderLinking
source: Linking
kk: Байланыс
ru: Связь

# orderCreateComplaint
source: Create Complaint
kk: Шағым құру
ru: Создать жалобу

# orderCreateComplaintReason
source: Please provide a reason for your complaint:
kk: Шағым себебін көрсетіңіз:
ru: Пожалуйста, укажите причину вашей жалобы:

# orderComplaintReasonLabel
source: Reason of Complaint
kk: Шағым себебі
ru: Причина жалобы

# orderComplaintReasonRequired
source: Please enter a reason for the complaint
kk: Шағым себебін енгізіңіз
ru: Пожалуйста, введите причину жалобы

# orderComplaintCreatedSuccess
source: Complaint created successfully
kk: Шағым сәтті құрылды
ru: Жалоба успешно создана

# orderComplaintCreateError
source: Error creating complaint: {error}
kk: Шағым құру қатесі: {error}
ru: Ошибка создания жалобы: {error}

# orderChangeStatusTitle
source: Change Order Status
kk: Тапсырыс статусын өзгерту
ru: Изменить статус заказа

# orderChangeStatusMessage
source: Change order status from "{oldStatus}" to "{newStatus}"?
kk: Тапсырыс статусын "{oldStatus}" мәнінен "{newStatus}" мәніне өзгерту керек пе?
ru: Изменить статус заказа с "{oldStatus}" на "{newStatus}"?

# orderChange
source: Change
kk: Өзгерту
ru: Изменить

# orderStatusChanged
source: Order status changed to {status}
kk: Тапсырыс статусы {status} мәніне өзгертілді
ru: Статус заказа изменен на {status}

# orderStatusChangeError
source: Error changing order status: {error}
kk: Тапсырыс статусын өзгерту қатесі: {error}
ru: Ошибка изменения статуса заказа: {error}

# orderCreated
source: Created: {date}
kk: Құрылған: {date}
ru: Создан: {date}

# orderUpdated
source: Updated: {date}
kk: Жаңартылған: {date}
ru: Обновлен: {date}

# orderComplaint
source: Complaint
kk: Шағым
ru: Жалоба

# orderProducts
source: Products
kk: Өнімдер
ru: Продукты

# orderNoProducts
source: No products in this order
kk: Бұл тапсырыста өнімдер жоқ
ru: Нет продуктов в этом заказе

# orderTotal
source: Total
kk: Барлығы
ru: Итого

# orderQuantity
source: Quantity: {quantity}
kk: Саны: {quantity}
ru: Количество: {quantity}

# orderPricePerUnit
source: Price per unit: {price} ₸
kk: Бірлік бағасы: {price} ₸
ru: Цена за единицу: {price} ₸

# orderProductId
source: Product #{productId}
kk: Өнім #{productId}
ru: Продукт #{productId}

# orderSupplier
source: Supplier
kk: Жеткізуші
ru: Поставщик

# orderConsumer
source: Consumer
kk: Тұтынушы
ru: Потребитель

# orderAssignedSalesperson
source: Assigned Salesperson
kk: Тағайындалған сатушы
ru: Назначенный продавец

# orderConsumerStaff
source: Consumer Staff
kk: Тұтынушы қызметкерлері
ru: Персонал потребителя

# companiesCompany
source: Company
kk: Компания
ru: Компания

# commonCreate
source: Create
kk: Құру
ru: Создать

# linkingsPending
source: Pending
kk: Күтуде
ru: В ожидании

# linkingsAccepted
source: Accepted
kk: Қабылданған
ru: Принята

# linkingsRejected
source: Rejected
kk: Қабылданбаған
ru: Отклонена
